src/DataProcessors/ИС_WB_ВыгрузкаКарточекТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_WB_ВыгрузкаКарточекТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_WB_НастройкиСопоставленияХарактеристикТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_НастройкиСопоставленияХарактеристикТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Раздел1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Категории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХарактеристикиНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/ИС_WB_ВыгрузкаКарточекТоваров/Forms/ФормаСопоставленияПолейНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПараметрыПоейКатегорийНаСервере();
	ЗаполнитьДеревоМетаданных();	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УстановитьПараметрыПоейКатегорийНаСервере();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ДеревоМетаданныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если СтрНайти(Элемент.ТекущиеДанные.ПолноеИмя, ".") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрДерева = ДеревоМетаданных.НайтиПоИдентификатору(Значение);
	
	Раздел1С = СтрДерева.ПолноеИмя;
		
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора = СформироватьДанныеВыбора();
	                                                            
	Поля1С.Очистить();
	
	Для Каждого Элемент Из ДанныеВыбора Цикл
		НоваяСтрока = Поля1С.Добавить();
		НоваяСтрока.Значение = Элемент.Значение;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура ПоляКатегорийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ПоляКатегорий.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Характеристика = ТекДанные.Наименование;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура Поля1СВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Поля1С.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Поле1С = ТекДанные.Значение;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаКлиенте
Процедура Добавить(Команда)	
	ДобавитьНаСервере();
	Элементы.СоответствиеРеквизитов.Обновить();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьДеревоМетаданных() 

	КоллекцииОбъектовМетаданных = Новый Массив;
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.Справочники);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	КоллекцииОбъектовМетаданных.Добавить(Метаданные.РегистрыСведений);
	
	ДеревоМетаданныхЗначение = РеквизитФормыВЗначение("ДеревоМетаданных");
	
	ПрефиксУдаляемыхОбъектов = "удалить";
	УдаляемыеОбъекты = Новый СписокЗначений;
	
	Для Каждого КоллекцияОбъектовМетаданных Из КоллекцииОбъектовМетаданных Цикл
		
		Если КоллекцияОбъектовМетаданных.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
	
		СтрокаМетаданные = ДеревоМетаданныхЗначение.Строки.Добавить();
		
		ИмяМетаданных = КоллекцияОбъектовМетаданных[0].ПолноеИмя();
		КолвоСимволов = СтрНайти(ИмяМетаданных, ".");
		НазваниеМетаданных = Лев(ИмяМетаданных, КолвоСимволов - 1);
		
		СоответствиеНаименованийМетаданных = ПолучитьСоответствиеИменМетаданных();
		СинонимМетаданных = СоответствиеНаименованийМетаданных.Получить(НазваниеМетаданных);
		
		СтрокаМетаданные.Метаданные = НазваниеМетаданных;
		СтрокаМетаданные.ПолноеИмя = СинонимМетаданных;
		СтрокаМетаданные.Синоним = СинонимМетаданных;
		
		Для Каждого ОбъектМетаданных Из КоллекцияОбъектовМетаданных Цикл
			
			Если НазваниеМетаданных = "Справочник" Или НазваниеМетаданных = "ПланВидовХарактеристик" Тогда
				
				Если ОбъектМетаданных.Имя = "Номенклатура" Или ОбъектМетаданных.Имя = "ДополнительныеРеквизитыИСведения" Или ОбъектМетаданных.Имя = "ХарактеристикиНоменклатуры" Тогда										
			
					СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
					СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
					СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
					СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
			
				// не у всех метаданных есть владельцы
				//ИначеЕсли ОбъектМетаданных.Владельцы.Количество() > 0 Тогда
				//
				//	Для Каждого Владелец Из ОбъектМетаданных.Владельцы Цикл
				//		
				//		Если Владелец.Имя = "Номенклатура" Тогда
				//			
				//			СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
				//			СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
				//			СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
				//			СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
				//			Прервать;
				//			
				//		КонецЕсли;
				//	
				//	КонецЦикла; 
								
				Иначе
					Продолжить;
				КонецЕсли;	
			//+ ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826			
			ИначеЕсли ОбъектМетаданных.Имя = "ДополнительныеСведения" Тогда
				
				СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
				СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
				СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
				СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
				//- ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826
				
			Иначе				
			
				Если СтрНачинаетсяС(НРег(ОбъектМетаданных.Имя), ПрефиксУдаляемыхОбъектов) Тогда
					Продолжить;
				КонецЕсли;
				
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
				
				Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл					
				
					Если Измерение.Тип = Новый ОписаниеТипов(МассивТипов) Тогда
				
						СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
						СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
						СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
						СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
						Прервать;
				
					КонецЕсли;
				
				КонецЦикла;
				
				Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
					
					Если Ресурс.Тип = Новый ОписаниеТипов(МассивТипов) Тогда
						
						Если Не (СтрокаМетаданные.Строки.Найти(ОбъектМетаданных.Имя, "Метаданные") = Неопределено) Тогда
							Продолжить;
						КонецЕсли;
						
						СтрОбъектМетаданных = СтрокаМетаданные.Строки.Добавить();
						СтрОбъектМетаданных.Метаданные = ОбъектМетаданных.Имя;
						СтрОбъектМетаданных.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
						СтрОбъектМетаданных.Синоним = ОбъектМетаданных.Синоним;
						Прервать;
					
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоМетаданныхЗначение, "ДеревоМетаданных");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервереБезКонтекста
Функция ПолучитьСоответствиеИменМетаданных()

	СоответствиеНаименованийМетаданных = Новый Соответствие;
	СоответствиеНаименованийМетаданных.Вставить("Справочник", "Справочник");
	СоответствиеНаименованийМетаданных.Вставить("ПланВидовХарактеристик", "План видов характеристик");
	СоответствиеНаименованийМетаданных.Вставить("РегистрСведений", "Регистр сведений");
	
	Возврат СоответствиеНаименованийМетаданных;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура УстановитьПараметрыПоейКатегорийНаСервере()
	ПоляКатегорий.Параметры.УстановитьЗначениеПараметра("Ссылка", Категория);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Функция СформироватьДанныеВыбора()
	                
	ЗначенияВыбора = Новый СписокЗначений;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Раздел1С);
	
	//+ ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826	
	Если СтрНайти(Раздел1С, "ДополнительныеСведения") <> 0 Тогда
		ЗаполнитьДопСвойства(ЗначенияВыбора);
	//Если СтрНайти(Раздел1С, "Справочник") <> 0 Тогда
	ИначеЕсли СтрНайти(Раздел1С, "Справочник") <> 0 Тогда
	//- ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826
		          
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			ЗначенияВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);	
		КонецЦикла;
		
		ЗначенияВыбора.Добавить("Наименование", "Наименование");
		ЗначенияВыбора.Добавить("Код", "Код");
	
	ИначеЕсли СтрНайти(Раздел1С, "ПланВидовХарактеристик") <> 0 Тогда
		ЗаполнитьСвойствамиНоменклатуры(ЗначенияВыбора);
		ЗаполнитьСвойствамиХарактеристики(ЗначенияВыбора);
	Иначе
		
		Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
			ЗначенияВыбора.Добавить(Измерение.Имя, Измерение.Синоним);	
		КонецЦикла;	
		
		Для Каждого Ресурс Из ОбъектМетаданных.Ресурсы Цикл
			ЗначенияВыбора.Добавить(Ресурс.Имя, Ресурс.Синоним);	
		КонецЦикла;	

	КонецЕсли;
	
	ЗначенияВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Возврат ЗначенияВыбора;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьСвойствамиНоменклатуры(ЗначенияВыбора)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство.Имя КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначенияВыбора.Добавить(Выборка.Свойство, Выборка.Заголовок);
	КонецЦикла;
	
КонецПроцедуры

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ЗаполнитьСвойствамиХарактеристики(ЗначенияВыбора)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Наименование КАК Свойство,
	|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты";

	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначенияВыбора.Добавить(Выборка.Свойство,Выборка.Заголовок);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Ивонин К.А. 20.10.21 УА #38646
&НаСервере
Процедура ДобавитьНаСервере()
	
	МенеджерЗаписи = РегистрыСведений.ИС_WB_НастройкиСопоставленияХарактеристикТоваров.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.Категория = Категория; 
	МенеджерЗаписи.Характеристика = Характеристика; 
	МенеджерЗаписи.Раздел1С = Раздел1С;
	МенеджерЗаписи.Поле1С = Поле1С; 
	МенеджерЗаписи.Записать(); 	

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.10.21 УА #38646

//+ ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826
&НаСервере
Процедура ЗаполнитьДопСвойства(ЗначенияВыбора)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДополнительныеСведения.Свойство.Наименование КАК Заголовок,
	|	ДополнительныеСведения.Свойство.Имя КАК Свойство
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДополнительныеСведения.Объект) = ТИП(Справочник.Номенклатура)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗначенияВыбора.Добавить(Выборка.Свойство, Выборка.Заголовок);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 13.03.2025 УА #95826

#КонецОбласти
